{
  "id": 424,
  "page": 1,
  "results": [
    {
      "author": "Mayurpanchamia",
      "author_details": {
        "name": "",
        "username": "Mayurpanchamia",
        "avatar_path": null,
        "rating": 8.0
      },
      "content": "Directed by Steven Spielberg, the name is enough. He enjoys immense love and justified appreciation. It’s not just a rumour, but his name transcends to million footfalls to theatres and multiple OTT replays. But this movie is special because as a Jew Spielberg felt the pain of Holocaust and thus this was personal. Spielberg’s paternal grandparents were Jews from Ukraine. I really hope things cool down very soon in Ukraine and somebody someday make a film on the crisis in Ukraine.\r\n\r\nAfter watching “The Kashmir Files” I felt like watching the list because I wanted to see how we can make better movies without the propaganda. The Kashmir Files is necessary minus the very few political flaws and propaganda it subtly injects into its viewers. Asking the questions is not anti-national and not all JNU people come with an agenda. Kashmir Files tells many truths and ought to be told but also hides a lot of the actual/factual truths. Just like a dictator it blatantly shows only the side they want to without any iota of balance.\r\n\r\nBut Schindler’s List is different because it never lets the bleakness of the Holocaust overwhelm its important theme of fighting for the common good. The director says, “My primary purpose in making Schindler’s List was for education. The Holocaust had been treated as just a footnote in so many textbooks or not mentioned at all. Millions knew little if anything about it. Others tried to deny it happened at all.”\r\n\r\nKeneally’s best-known work, Schindler’s Ark was published in 1982; also known as Schindler’s List and film released in 1993, tells the true story of Oskar Schindler, a German industrialist who saved more than 1,300 Jews from the Nazis. . Liam Neeson plays very well Schindler however shows his true side that he was a playboy and so on. He was not a saint. He cheated on his wife, drank excessively and spied for Abwehr, the counter-espionage arm of the Wehrmacht (German army), in Czechoslovakia.\r\n\r\nBut the true characteristics of human beings cannot be spliced even in the most fascist regimes. Sometimes character flaws bring in real joy, excitement and belief. Steven Spielberg’s movie, Schindler’s List, while important, impressive and admirable in many respects, tries to show the true face of propaganda and mass bullshit and how an entire nation can be mass brainwashed to fuel hatred amoung it’s people and bring a great nation down. Something India and Indians need to really ponder upon.\r\n\r\nAfter Germany invaded Poland in 1939, Oskar Schindler sets up an enamelware factory in Krakow that used a combination of Jewish workers interred by the Germans and free Polish workers. His initial interest, of course, was to make money. But as time went on, he grew to care about his Jewish workers, particularly those with whom he came into contact on a daily basis. In addition, helping Jews became a way to fight against what he viewed as disastrous and brutal policies emanating from Adolf Hitler and the SS. Oskar Schindler convinced German authorities his factory was vital and that he needed trained workers. But Schindler did not author or dictate the list instead, Marcel Goldberg, a Jewish “clerk” compiled it. There is a line in the movie which goes like, “That’s not just good old fashioned Jew hate talk. Its policy now” and it hits hard and makes us aware that nothing has changed in present too. Itzhak Stern, played in the movie by Ben Kingsley was one of the most powerful character more of culmination of lot of people at that time. Oskar Schindler was a great man publicly and a not so great man privately but he saved the lives of more than 1,000 Jews during the Holocaust and that’s why a movie has been made on him. The imperfections in his character and the nuances in the historical record only make his story more remarkable.\r\n\r\nThe movie’s budget was just $22 million. No one had ever made a profitable film about the Holocaust. Spielberg himself didn’t take a salary, calling it “blood money.” Something Vivek Agnihotri and makers of “The Kashmir Files” should ponder upon. As I write this Kashmir Files has already touched 250 Cr. Such sensitive films should come with not just spontanity but also empathy which is found in Spielberg and lacks in Agnihotri’s.\r\n\r\nThis movie reminded me of another Spielberg movies which moved and caved in Bridge of Spies. Bridge was about the fine art of negotiation and the List is about the fine art of “Gratitude” you will hear this word a lot in the Schindler’s List. I felt both the movies very similar and fantastic.\r\n\r\nThe use of black and white cinematography also makes me think of “KOTA FACTORY” both shot in black and white to resemble the dark and hollowness of the subject material. Art does make you uncomfortable and that’s it’s Dharma and Karma but propoganda does give you only the bigoted narration with giving the example that his master is always a good guy.\r\n\r\nIn one scene, Schindler implores Goeth to spray water into the cars on a hot day to help the dehydrated Jews inside. Goeth tells him that to do so would give false hope—a clear implication that the trains deliver Jews to their deaths.The lists become increasingly ominous during sorting exercises to determine who is fit to work or who is “essential” and who is not. Those deemed “unessential” are placed on the list to be evacuated to extermination camps. Stern’s name appears on a list sending him to Auschwitz. When Schindler saves him, an SS officer mentions that it doesn’t matter which Jew gets on the train, and that keeping track of names just means more paperwork. This disregard for names and particularity symbolizes the extent to which the Nazis dehumanized Jews. Schindler’s list is one that saves lives. The Nazis’ lists represent evil and death, but Schindler’s list represents pure good and life. In an ironic twist, the final list in the film is a list that Schindler’s workers give to him—a list of their signatures vouching for Schindler as a good man, to help him if Allied soldiers catch him. The saved in turn become saviors.\r\n\r\nThe one-armed man who thanks Schindler for employing him and making him “essential” is shot in the head by an SS officer as he shovels snow the next day. Blood flows from his head, staining the surrounding snow. In a later scene, Goeth orders the execution of a Jewish woman engineer who tells Goeth of a fatal construction error. Her blood, too, pours from her head and darkens the snow around her. The blood pouring from the victims’ heads is both literally and metaphorically the lifeblood being bled out of the Jewish race. In yet another scene, Goeth attempts to execute a rabbi working at the Plaszów labor camp. The rabbi stays kneeling as Goeth again and again attempts to shoot him in the head. But the gun jams, and the rabbi is spared, symbolizing the tenuous protection the Schindlerjuden had and the fine line between life and death.\r\n\r\nThe film talks about the corruption of not just money but hearts and minds too. It shows us privileges and different aspects of life while keeping humanity before profits and ideologies. Intricacies of personal and professional lives are intertwined here for the good sake.\r\n\r\nThe film ends with – “WHOEVER SAVES ONE LIFE, SAVES THE WORLD ENTIRE.”\r\n\r\nThe actual Oskar Schindler died in 1974 and was buried in Jerusalem on Mount Zion. He is the only former member of the Nazi Party to be honored in this way. He and his wife Emilie were named Righteous Among the Nations by the Israeli government in 1993, something that would be hard to believe could happen without the film highlighting his life. \r\n\r\nAs we all know, Spielberg and the film went on to win several Academy Awards for Schindler’s List, including Best Picture and Best Director. The film also won for Best Screenplay, Best Cinematography, and Best Editing. Spielberg would win another Best Director Oscar for Saving Private Ryan five years later, but for him what happened with Schindler would be his crowning achievement. \r\n\r\nSchindler’s List is a rare movie whose legacy is just as important as its existence.\r\n\r\nPerhaps the lasting legacy of the film, aside from tolerance, is the image of the girl in red. During the liquidation of the ghetto scene, we see a little girl wandering. She serves as the person Schindler and the audience fixate on. The weight of the atrocity that we carry as viewers.When prompted to talk about one of the only color moments in the film, the girl in red, Spielberg told USA Today, “In (Thomas Keneally’s) book, Schindler couldn’t get over the fact that a little girl was walking during the liquidation of the Krakow ghetto. While everyone was being put on trucks or shot in the street, one little girl in a red, red coat was being ignored by the SS.”\r\n\r\n\r\nFor Spielberg, that came to symbolize the blind eye world leaders turned to the murders going on in Europe. “To me, that meant that Roosevelt and Eisenhower—and probably Stalin and Churchill—knew about the Holocaust… and did nothing to stop it. It was almost as though the Holocaust itself was wearing red.” Same repeats in Ukraine too.\r\n\r\nSpielberg helped develop and found The Shoah Foundation. It furthered the education and established “The Survivors of the Shoah Visual History Foundation” to document the testimonies of thousands of survivors. For Spielberg, he wanted future generations to have these eyewitness accounts to serve as a permanent record. He hoped that there would never be a time we saw Nazism and fascism on the rise again. The project has collected the testimony of more than 55,000 survivors and witnesses to the Holocaust as well as other atrocities. “It wouldn’t have happened without Schindler’s List,” he said. “The Shoah Foundation wouldn’t exist.” Something the Hypocritic Vivek Agnihotri should think about. I still stand by that “The Kashmir files” should be shown to everyone without propoganda and only one agenda that this atrocities and “Genocide” should not be repeated on any one anywhere.\r\n\r\nThe film is available on Netflix. Go, watch, think.\r\n\r\nhttps://letterboxd.com/mayurpanchamia/film/schindlers-list/\r\n\r\nhttps://mayurpanchamia.wordpress.com/2022/03/27/schindlers-list/\r\n\r\nhttps://www.themoviedb.org/review/62405d62706e56005dc24c03\r\n",
      "created_at": "2022-03-27T12:38:48.601Z",
      "id": "62405ad8519bbb0089f4148b",
      "updated_at": "2022-03-28T15:40:00.026Z",
      "url": "https://www.themoviedb.org/review/62405ad8519bbb0089f4148b"
    },
    {
      "author": "CinemaSerf",
      "author_details": {
        "name": "CinemaSerf",
        "username": "Geronimo1967",
        "avatar_path": "/yz2HPme8NPLne0mM8tBnZ5ZWJzf.jpg",
        "rating": 7.0
      },
      "content": "There's a powerful little low-budget effort with Ralph Richardson called \"The Silver Fleet\" (1943) that illustrates just how difficult it was for those in the occupied territories to continue to do what was right without looking like a collaborator and/or ending up against a wall of Nazi bullets. Well here, Steven Spielberg takes that dangerous occupation and scales it up somewhat as the eponymous Czech industrialist and arms manufacturer (Liam Neeson) finds his increasing revulsion to the brutality of their new occupying power driving him, with the able assistance of his Jewish factory manager \"Stern\" (Ben Kingsley), to find ways to keep them from being routinely slaughtered. Getting them out is not really an option, so he invents ways of convincing the authorities that they are more useful alive and decently fed/housed - even suggesting the usefulness of children's small fingers to polish shell casings - to avoid them being deported to the now fully functioning Auchwitz extermination camp. The story is history but the manner in which it is delivered here is poignant and potent. Schindler's gradual shift from a venally induced indifference to one of active concern is well handled by Neeson's considered performance and Kingsley works well as his low-level but crucial co-conspirator. Plaudits must also go to Ralph Fiennes with, I think, the best portrayal of his career as the odious Commandant Goeth who combines just about every element of the worst in human nature into one ghastly individual eliciting a palpable degree of loathing. Does it need to be 3¼ hours long? Well I'm not so sure about that, and there are times when the repetitive oppressiveness of their gruelling environment risks de-sensitising the message a little, but for the most part the abusive and terrifying lives led by the Jewish prisoners and the increasingly perilous path being taken by those trying to help is well held together with some stunning cinematography and an untypical John Williams score. It's definitely a big screen occasion - somehow television reduces it's impact, so if you can see it in a cinema. Either way, it does offer some salutary lessons in man's inhumanity, and humanity to our fellow man!",
      "created_at": "2024-01-28T14:48:08.157Z",
      "id": "65b669282faf4d00c9dc1689",
      "updated_at": "2024-01-28T14:48:08.282Z",
      "url": "https://www.themoviedb.org/review/65b669282faf4d00c9dc1689"
    },
    {
      "author": "Zak_Jaggs",
      "author_details": {
        "name": "",
        "username": "Zak_Jaggs",
        "avatar_path": null,
        "rating": 10.0
      },
      "content": "Emotionally powerful and historically very important. This film deals with possibly the hardest topic in human history, and it does it with class, purpose and excellent filmmaking. Liam Neeson is brilliant as Schindler; Fiennes is utterly horrifying as the terrible Goth and all the other character actors hit the mark brilliantly. The decision to make it black and white makes Schindler's List stand-out and feel distinct, it is a piece of genius. In the end this film is about the utter depravity that humanity is capable of, and the utterly brilliant heroism humanity is capable of, WW2 and the Holocaust in real life brought out the worst in us as a species and it bought out the best of us, this film captures that, but it also captures the complexities of the people at the heart of the most dramatic events in world history, no other film does this as well. Top quality and a very good start point for people who are unfimilar with the nitty-gritty of the Nazi regime.",
      "created_at": "2024-12-19T23:16:11.774Z",
      "id": "6764a93bb67e4547255ddd83",
      "updated_at": "2024-12-24T02:54:13.785Z",
      "url": "https://www.themoviedb.org/review/6764a93bb67e4547255ddd83"
    }
  ],
  "total_pages": 1,
  "total_results": 3
}
