{
  "id": 129,
  "page": 1,
  "results": [
    {
      "author": "ZeBlah",
      "author_details": {
        "name": "ZeBlah",
        "username": "TheBlah",
        "avatar_path": "/d7rZv7xFhXHy0OLbVc2byJiZwEU.jpg",
        "rating": 10.0
      },
      "content": "One of the great \"masters\" of the anime art. Somehow, if I would personally associate \"Akira\" to \"self-destruction\", then this anime would be the opposite :)",
      "created_at": "2019-06-29T20:24:51.877Z",
      "id": "5d17c91385702e001eb921db",
      "updated_at": "2021-06-23T15:58:23.763Z",
      "url": "https://www.themoviedb.org/review/5d17c91385702e001eb921db"
    },
    {
      "author": "CinemaSerf",
      "author_details": {
        "name": "CinemaSerf",
        "username": "Geronimo1967",
        "avatar_path": "/yz2HPme8NPLne0mM8tBnZ5ZWJzf.jpg",
        "rating": 7.0
      },
      "content": "I quite liked the look of the new house that \"Chihiro\" and her parents were to move to, but she isn't so keen, and being ten had the weight of the world on her shoulders. En route to meet the removal men, her dad takes a wrong turning and soon, together with her mum, end up at the end of a tunnel. What would you do? Go in of course! Luckily it's quite a short walk before they find themselves in a small village that's full of shops all laid out for a banquet. Mum and dad tuck in but the young girl just wants to get going. Ignored, she explores a little as they gorge themselves and that's when she encounters the young \"Haku\" who suggests that she might like to leave. Snag is - her parents have quite literally now gone a bit porcine and she's going to have to rely on her new friend if she is to rescue them from an impending visit to the abattoir. A job is her first task, and for that she needs a contract with the wart-nosed witch \"Yubaba\" - and so off we go on a series of marvellously creative escapades discovering some coal spirits; that her friend has a secret identity; her boss an huge great baby and the entire place serves as a sort of bathhouse for the enigmatic \"No Face\" whose agenda isn't clear to anyone, though we do know he has a rapacious appetite and can make his own gold! The detail of the animation is astonishing and coupled with the mysticism of ancient Japanese folk lore works really well at creating a characterful and engaging story. I just love the lithe dragons of Oriental mythology as opposed to the scaly, stodgy, European ones. The concept of identity underpins much of the narrative here, with not just \"Chihiro\" but pretty much everyone else coming to terms with flaws and strengths in their personalities requiring a degree of human spirit, trust and forgiveness if ever anyone is to thrive and if ever she and her folks are to get to that new house on the hill. It's two hours really goes fly by and I thoroughly enjoyed it.",
      "created_at": "2024-12-28T16:43:49.694Z",
      "id": "67702ac55f1c4fa473612f7a",
      "updated_at": "2024-12-28T16:43:49.830Z",
      "url": "https://www.themoviedb.org/review/67702ac55f1c4fa473612f7a"
    }
  ],
  "total_pages": 1,
  "total_results": 2
}
