{
  "id": 389,
  "page": 1,
  "results": [
    {
      "author": "Andres Gomez",
      "author_details": {
        "name": "Andres Gomez",
        "username": "tanty",
        "avatar_path": null,
        "rating": 10.0
      },
      "content": "Master piece. Fantastic script and evolution of the characters.",
      "created_at": "2013-05-13T15:41:51.562Z",
      "id": "519109bf19c29548540227d6",
      "updated_at": "2021-06-23T15:57:21.378Z",
      "url": "https://www.themoviedb.org/review/519109bf19c29548540227d6"
    },
    {
      "author": "John Chard",
      "author_details": {
        "name": "",
        "username": "John Chard",
        "avatar_path": "/utEXl2EDiXBK6f41wCLsvprvMg4.jpg",
        "rating": 9.0
      },
      "content": "Unlikely, but it is possible.\r\n\r\n12 Angry Men is directed by Sidney Lumet and adapted from a teleplay of the same name by Reginald Rose. The cast is headed by Henry Fonda and Lee J. Cobb. The film tells the story of a jury made up of 12 men as they deliberate the guilt or innocence of a defendant on the basis of reasonable doubt. Except for two short scenes at the beginning and end of the film, it's filmed entirely on one set, that of the jury deliberation room.\r\n\r\nSweaty, gritty, claustrophobic - all words that sit snugly in the context of Lumet's excellently crafted deconstruction of 12 men trying to arrive at one verdict in the case of a Puerto Rican youth on trial for the murder of his father. The evidence appears overwhelming, there's witnesses, a murder weapon and motive, the boy is surely on his way to the electric chair. 11 of the men are convinced he's guilty, only one man stands alone, Henry Fonda's juror number 8, who refuses to turn in a vote of guilty until the evidence and facts are discussed at length. As the others rail against him and tempers get frayed, juror number 8 prompts the others to examine their own prejudices and commitment to justice.\r\n\r\nA lesson in tight direction and editing, and with performances to match, 12 Angry Men is quite simply not to be missed by those seeking to venture into classic cinema. 9/10",
      "created_at": "2020-03-29T14:56:48.949Z",
      "id": "5e80b7301d6c5f00141d8798",
      "updated_at": "2024-05-16T15:22:27.873Z",
      "url": "https://www.themoviedb.org/review/5e80b7301d6c5f00141d8798"
    },
    {
      "author": "barrymost",
      "author_details": {
        "name": "",
        "username": "barrymost",
        "avatar_path": "/ibbLLFhqCRY4Dh37WoBGMHSCThT.jpg",
        "rating": 10.0
      },
      "content": "Jurors:\r\n\r\nMartin Balsam\r\n\r\nJohn Fiedler\r\n\r\nLee J. Cobb\r\n\r\nE.G. Marshall\r\n\r\nJack Klugman\r\n\r\nEdward Binns\r\n\r\nJack Warden\r\n\r\nHenry Fonda\r\n\r\nJoseph Sweeney\r\n\r\nEd Begley\r\n\r\nGeorge Voskovec\r\n\r\nRobert Webber\r\n\r\n12 jurors deliberate on the guilt or innocence of a young Spanish-American man accused of murdering his father. As the moments tick by, the discussion becomes an expose of each individual man's thoughts, feelings, prejudices, and secrets.\r\n\r\nThis is Fonda at his best, backed up with excellent support from all 11 of his fellow jurors. Lee J. Cobb is also a standout.\r\n\r\nCrackling script by Reginald Rose, with superb direction by Sidney Lumet.  Full of memorable moments and great dialogue and character development; this is one of the greatest courtroom dramas this reviewer has ever seen.",
      "created_at": "2021-12-06T15:56:24.222Z",
      "id": "61ae32a80d2f53001cd78752",
      "updated_at": "2021-12-06T15:56:24.222Z",
      "url": "https://www.themoviedb.org/review/61ae32a80d2f53001cd78752"
    },
    {
      "author": "AstroNoud",
      "author_details": {
        "name": "",
        "username": "AstroNoud",
        "avatar_path": "/6zLnrhVdSDzTjhwjKxE5xQdk2Wu.jpg",
        "rating": 9.0
      },
      "content": "A timeless classic in which the characters really come to life. Slowly exposing each man's thoughts, personalities and prejudices, ‘12 Angry Men’ isn't really about solving the crime, but about the power of reasoning, discussion and dialogue.\r\n\r\n9/10",
      "created_at": "2022-03-11T16:04:32.131Z",
      "id": "622b73107707000045a9381e",
      "updated_at": "2022-03-11T16:04:32.131Z",
      "url": "https://www.themoviedb.org/review/622b73107707000045a9381e"
    },
    {
      "author": "Krakatoa69",
      "author_details": {
        "name": "",
        "username": "Krakatoa69",
        "avatar_path": null,
        "rating": 10.0
      },
      "content": "Unassuming. This is the first impression one may have, upon reading what this movie is about: 12 jurors deliberate about a murder case, where the accused suspect is the victim's son, a 18 y.o. boy. They must reach a unanimous verdict of guilty or innocent.\r\n\r\nAs it starts, it seems pretty much set, and everybody appears sure of the boy's guilt, except for one man. \"How can someone still have doubt, when so many (incl. more experienced jurors) are so sure?\".\r\n\r\nWhat follows is an exciting and carefully constructed script of more deeply detailed observation and reason-based discussions, often derailed by outburst of anger and impatience, as apparently firm evidence succumb to a more thoughtful and impartial analysis. Ultimately, not all is what it seems - specially true regarding *all* the jurors. Worth re-watching as much as you feel like finding all hidden clues and details therein.",
      "created_at": "2022-12-18T23:05:26.389Z",
      "id": "639f9cb6be6d8800d9ccc2c5",
      "updated_at": "2022-12-19T15:43:01.221Z",
      "url": "https://www.themoviedb.org/review/639f9cb6be6d8800d9ccc2c5"
    },
    {
      "author": "CinemaSerf",
      "author_details": {
        "name": "CinemaSerf",
        "username": "Geronimo1967",
        "avatar_path": "/yz2HPme8NPLne0mM8tBnZ5ZWJzf.jpg",
        "rating": 8.0
      },
      "content": "Twelve jurors are sent to their deliberating room after hearing the evidence in a murder trial. It's potentially the hottest day of the year as this collection of white, male, individuals take their seats around the table and wait for foreman Martin Balsam - none of the characters have names, here - to call them to order. A first vote is in order - it's a slam dunk - the accused is obviously guilty - 11-1! Henry Fonda is the dissenter. What has he seen that the others missed? What has he not seen that the others have understood? What now ensues is one of the best written and characterised, compelling, dramas cinema has ever produced. Excellent efforts from Lee J. Cobb, in particular, but from all concerned allow the tension to positively leap from the screen at us. This story gradually fills us in with the details of the crime, with the statements of the witnesses and, initially at any rate, illustrates just how cursorily many of these men treat this case. They want to get home for dinner, for a baseball game, to their wives and children. The fact that they are considering the life and death of an eighteen year old man seems tangential to the inconvenience they are facing or to the value they place on this man's survival. Reginald Rose's original screenplay takes us through the whole gamut of human bigotries and intolerances with everything from ageism, racism, respect and sexism rearing their ugly heads as the tension in their discussions rises and the true nature of these characters starts to emerge. Timidity, assertion, rationality - all are on display as these men start with a position that they may well not end up with. Ninety minutes seems far too short - but it works very well, rarely coming up for air - but what will their verdict be? Big screen if you can. Not because the scenario (a jury room) needs it - but there is so much energy and vitality in this film, that is just the best way to appreciate it a strong cast who put their all into their roles - and it works!",
      "created_at": "2023-04-17T08:26:08.293Z",
      "id": "643d02a08ec4ab0470af7a38",
      "updated_at": "2023-04-17T08:26:08.395Z",
      "url": "https://www.themoviedb.org/review/643d02a08ec4ab0470af7a38"
    },
    {
      "author": "Filipe Manuel Neto",
      "author_details": {
        "name": "Filipe Manuel Neto",
        "username": "FilipeManuelNeto",
        "avatar_path": "/nidqITf735x9xxHfncXkT9BmOQ7.png",
        "rating": 10.0
      },
      "content": "**A very well-made film, with great actors.**\r\n\r\nAs a non-American myself, it's a little tricky for me to understand how well this justice system works. Don't get me wrong, but in my country it is not usual to resort to this type of trials, where the decision depends largely on the lawyers' ability to convince a group of jurors. Here, the decision depends more on the judge, or on a collective of judges. Resorting to a jury trial is provided for in Portuguese law, but must meet a tight set of prerequisites, which turns out to be a very unusual option.\r\n\r\nSo to understand this movie better I had to go read a little bit about how a real life jury trial works. And this is where my doubts about this film are greatest. Is it really a film that respects what really happens in the room where a jury deliberates what sentence to pass? Throughout the film, it is quite clear that the trial did not go well, mainly due to a largely ineffective defense and incapable of securing the interest of the accused (something difficult to admit, especially in a case of capital punishment). Could the jury have done anything about it other than pass sentence? I confess, I don't know. I leave this to the jurists, lawyers and people who can understand more about the subject.\r\n\r\nThe film is a bit like one of those plays that ends up being taken to the cinema: the action takes place overwhelmingly in the same environment, quite confined, and with a limited group of characters who interact with each other and dialogue. Dialogues are an essential part of the film and they are not always nice. It is noted that there is an increase in tensions, and if there are several jurors interested in dismissing the matter and leaving, this changes little by little, as the details are analyzed and doubts about the trial increase. It is a frankly well-written, well-directed film (Sidney Lumet's best) and with a strong and competent cast where Henry Fonda assumes an unequivocal role, giving us one of the best works of his career. Also, Lee J. Cobb deserves a round of applause for the way he interprets and acts, in a deeply caustic character. Every actor has the time and material he needs to do a good job, and they all did.\r\n\r\nOn a technical level, it is an extremely discreet film, largely due to the low budget it was limited to. However, it is one of those films that proves that it is not necessary to have infinite money to do an excellent job. The setting is very believable, but where Lumet shined was in his clever use of cinematography and shooting angles to amplify feelings of confinement or discomfort. Sometimes, the camera gets so close to the actors' faces that we can see how much the excessive heat and subject tension is getting on their nerves.",
      "created_at": "2023-05-23T20:51:41.281Z",
      "id": "646d275da5046e016838a008",
      "updated_at": "2023-05-23T20:51:41.412Z",
      "url": "https://www.themoviedb.org/review/646d275da5046e016838a008"
    },
    {
      "author": "James",
      "author_details": {
        "name": "James",
        "username": "JN2012",
        "avatar_path": "/mgNCdh78RtrS3LctrrhD4bUQuQ6.jpg",
        "rating": 8.0
      },
      "content": ".",
      "created_at": "2023-10-20T14:43:30.357Z",
      "id": "65329212b2681f00feb0c210",
      "updated_at": "2023-12-03T11:50:24.572Z",
      "url": "https://www.themoviedb.org/review/65329212b2681f00feb0c210"
    }
  ],
  "total_pages": 1,
  "total_results": 8
}
